# Абсолютная сумма
# Даны пять чисел . Напишите программу, которая вычисляет сумму их модулей.

# Формат входных данных
# На вход программе подается пять действительных чисел, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести одно число – сумму модулей введёных чисел.

a1 = abs(float(input()))
a2 = abs(float(input()))
a3 = abs(float(input()))
a4 = abs(float(input()))
a5 = abs(float(input()))

sum = a1 + a2 + a3 + a4 + a5
print(sum)
